# CalculatedSupplyAirflow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..CalculatedSupplyAirflow Property
Space Class See Also
---
Get the Calculated Supply Airflow of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double CalculatedSupplyAirflow { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CalculatedSupplyAirflow As Double
	Get
```

Visual C++
---
```text
public:
property double CalculatedSupplyAirflow {
	double get ();
}
```

# Remarks
This property is used to get the Calculated Supply Airflow (Unit: CFM) of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace